#include <stdio.h>
#include <stdbool.h>
/*
בשאלה זו נממש ADT גנרי בשם EventManager שמטרתו לתזמן אירועים. תפקיד המערכת הוא לשמור
אוסף של אירועים שעתידים לקרות, וכאשר מגיע הזמן לביצוע של אירוע, להחזיר אותו ולהוציא אותו
מהמערכת. הטיפוס של אירוע הוא גנרי ונקבע על ידי המשתמש בזמן יצירת המערכת )שימו לב שכל מערכת
שמיוצרת מאחסנת רק אירועים מטיפוס אחד(. מערכת שכזו יכולה להיות בעלת שימושים מגוונים – לדוגמה,
מערכת לניהול פגישות, מערכת לניהול עדכוני תוכנה אוטומטיים, וכו'.
הערה: בשאלה זו ניתן להשתמש בכל מבנה נתונים של שפת C שמופיע בדפי העזר.
על ה-EventManager לתמוך בפעולות הבאות:
1 .יצירת מערכת חדשה, והריסת מערכת.
2 .Insert :הוספת אירוע חדש )עתידי( למערכת. הפונקציה מקבלת את האירוע להוספה ואת מספר
הדקות מהזמן הנוכחי ועד שהאירוע צריך להתרחש, ושומרת את האירוע.
3 .Tick :הפונקציה מקדמת את הזמן הנוכחי בדקה אחת. כמו כן, הפונקציה מחזירה רשימה של כל
האירועים שצריכים להתרחש בזמן זה, ומוציאה אותם מהמערכת. במידה ואין כל אירוע שאמור
להתרחש כרגע, היא מחזירה רשימה ריקה.
4 .החזרת מספר האירועים הכולל ששמור במערכת )רק אירועים שזמן התרחשותם עוד לא הגיע(.
5 .Remove :מחיקת אירועים עתידיים מהמערכת על פי תנאי גנרי מסויים. בהינתן תנאי ופרמטר
שמועבר לתנאי, הפונקציה תמחק מהמערכת כל אירוע שעומד בתנאי ושעוד לא התרחש. הפונקציה
מחזירה את מספר האירועים שהוסרו מהמערכת.
6 .איטרטור: פונקציות GetFirst ו-GetNext המאפשרות לקבל את כל האירועים העתידיים השמורים
במערכת )אין חשיבות לסדר בו האירועים מוחזרים(. אין צורך לממש את המאקרו foreach.
שימו לב שבמימוש הפשוט שלנו, למערכת אין למעשה גישה לשעון אמיתי. במקום זאת, אנו משתמשים
בפונקציה Tick על מנת ל
 */


//---1--------------------------------------------------------------------------------------------------------------------------------------------------------

typedef struct evenManager* EventManager;
typedef void* Event;

typedef enum {
    EM_SACCESS,
    EM_FAIL,
    EM_NEGATIVE_MIN_NUM,
    EM_OUT_OF_MEMORY,
}EMResualt;

 main() {

    return 0;
}
